<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<!-- Pra ser XHTML eu mudo coisas acima... comentário antes do DTD revolta o IE-->

<!-- E insiro alguns detalhes à tag html... e tudo em minúsculas ! -->
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" >
	<head>
		<!-- Mantenho isso aqui direitinho como HTML 4.01 -->
		<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
		<title>Falta do que fazer  ;-)</title>
		<link type="text/css" rel="stylesheet" href="css/mainPage.css" />
		<link rel="shortcut icon" type="image/x-icon" href="icon/BugsIcon16.gif" />
		
		<script type="text/javascript">
		
		function qualBrowser(){
			txt= "Nome: " + navigator.appName + "("+ navigator.appCodeName +")\n";
			txt+= "Versão: " + navigator.appVersion + "\n";
			txt+= "Cookies?: " + navigator.cookieEnabled + "\n";
			txt+= "Sistema: " + navigator.platform + "\n";
			alert(txt);
		}
		</script>
		
	</head>
	
	<body >
	
		<h1 id="logotipo">
		<!-- Detalhe do XHTML: o image deve ter a barra invertida em seu final e o espaço antes dela é importante para compatibilidade retroativa -->
		<img src="img/FaltaDoQueFazer_Logo600px.png" title="Tá moscando ? É a falta do que fazer..." 
		alt="Aqui estaria nosso logotipo: Não fique moscando..." width="60%" /> 
		
	    <a href="estudos/Marco_irock3.html" title ="Clique aqui e deixe uma pedra feliz">
		  <img id="rockImg" src="img/rockAlpha.png" alt="iRock" />
		</a>
		</h1>
	
		<div id="AndreRieu">
	
		<h2><q>Ol&aacute;, mam&atilde;e !</q> <br />N&atilde;o esqueci de voc&ecirc; !! </h2>
		<p id="linkMama"> Aqui est&atilde;o os v&iacute;deos do Andre Rieu em S&atilde;o Paulo !</p>
		
		<div id="buglink">
		<a href="andrerieu.html" title="André Rieu em São Paulo 2012">
			<img src="img/FaltaDoQueFazer_BugRieu.png" title="Andre Rieu" alt="Show do Andr&eacute; Rieu" width="61px" height="75px" />
		</a>
		</div>
			<p>Clique no simp&aacute;tico violinista ao lado para baixar os arquivos com trechos do show... <br />
			Todos s&atilde;o do tipo "divx" (renomeados para o tipo <q>avi</q>), gerados pelo celular (Atrix) e convertidos no computador. </p>
	
			<div id="critica">
				<h4 >André Rieu e o velho debate da cultura como entretenimento</h4>
				<p >Sucesso de público com seus espetáculos visuais que misturam trilhas sonoras a valsas vienenses, o maestro desperta a rejeição dos puristas eruditos...
					<br />
					<a href="http://veja.abril.com.br/noticia/celebridades/andre-rieu-e-o-velho-debate-da-cultura-como-entretenimento" class="linkMenor">
					Quem &eacute; contra o Andr&eacute; Rieu... (Veja Online)
					</a>
				</p>
				<h4>Com 24 shows, André Rieu bate recorde de Roberto Carlos no Ginásio do Ibirapuera </h4>
				<p >André Rieu quer conquistar o Brasil e bater um recorde pessoal. Nesta terça-feira (29), o violinista holandês 
					também conhecido como o "rei da valsa" apresenta o primeiro dos 24 shows marcados no Ginásio do Ibirapuera, em São Paulo. 
					Com capacidade para oito mil pessoas, a temporada tem datas esgotadas até o mês de julho. <br />
					<a href="http://musica.uol.com.br/ultnot/2012/05/28/a-unica-coisa-que-me-diferencia-dos-astros-pop-e-a-musica-diz-violinista-holandes-andre-rieu.jhtm"
					class="linkMenor">Sobre o sucesso do Andr&eacute; Rieu... (UOL)
					</a>
				</p>
			</div>
		</div>
		
		<div id="intro">
			<p class="version">vers&atilde;o 0.997 ;-D</p>
			<h2>A p&aacute;gina que exercita o &oacute;cio criativo ainda est&aacute; em constru&ccedil;&atilde;o...</h2>
			
			<div id="flashbug">
			
			<object width="220" height="160" type="application/x-shockwave-flash" data="CenarioMovimento.swf">
			<param value="medium" name="quality" />
			<param name="bgcolor" value="#d2b48c" />
			<param name="allowFullScreen" value="false" />
			<param name="allowscriptaccess" value="always" />
			<param value="CenarioMovimento.swf" name="movie" />
			<img src="http://www.cssnolanche.com.br/uploads/video.png" alt="Tinha um v&iacute;deo aqui !" title="Vídeo (Objeto multimídia)" />
			<!-- http://www.cssnolanche.com.br/inserir-flash-em-xhtml/ -->
			</object>
			
			</div>
			<p id="ocioso">
			&Eacute; tanta falta do que fazer que esta p&aacute;gina está sendo feita em HTML puro, sem editores e usando os c&oacute;digos especiais de 
			acentua&ccedil;&atilde;o para melhor compatibilidade com navegadores de todos os tipos e dispositivos 
			(ex: ao inv&eacute;s de <q><em>&aacute;</em></q>, eu escrevo <q>&amp;<em>a</em>acute;</q>...<br />
			O melhor de tudo &eacute; que temos uma falta de fazer com melhoria cont&iacute;nua e, por isso, passamos nossos c&oacute;digos para XHTML, o que h&aacute; de
			mais avan&ccedil;ado em p&aacute;ginas Web !!!<br /> <br />
			<span class="autor">26/06/2012, &agrave;s 20:40 h... </span><br />
			E a falta do que fazer continua... Agora estou arrumando o estilo da p&aacute;gina com CSS !! S&atilde;o os padr&otilde;es da Web sendo usados !
			&Eacute; tudo muito lindo !!! E vou tentar validar os c&oacute;digos CSS tamb&eacute;m...  ;-) <br />
			<br /> 
			<span class="autor">30/06/2012, das 17:04h &agrave;s 18:30h</span><br /> Ok, isto est&aacute; com cara de blog...<br />
			Enfim, aprendi o que eu queria... Dividir a p&aacute;gina em se&ccedil;&otilde;es l&oacute;gicas (div) e arrumar a formata&ccedil;&atilde;o !
			Isso fez o <q>Al&ocirc; Mam&atilde;e </q> ficar na lateral direita da p&aacute;gina, na caixa azul, n&atilde;o num lingui&ccedil;&atilde;o, como antes.
			<br /> Eu sei, eu sei... Pra quem v&ecirc; n&atilde;o tem nada demais, mas pra quem faz &eacute; uma baita diferen&ccedil;a !  :-)
			<br /> Ah !! Finalmente, &agrave;s 17:42h consegui fazer o link do <q>Bug Andr&eacute; Rieu</q> ficar alinhado e bonitinho ao lado do texto !
			<br /> Profissa ! Hora de publicar as novidades na Web !! :-)<br />
			<br /> E agora, <span class="autor">&agrave;s 18:30h</span>, adicionando anima&ccedil;&atilde;o em Flash !!! (foi mal se voc&ecirc; est&aacute; usando iPhone, isso n&atilde;o
			far&aacute; a menor diferen&ccedil;a neste caso, rsrsrs).
			<br /> Por pouco que n&atilde;o &eacute; mais dia 30/06, mas consegui fechar uma chamada em Flash v&aacute;lida ! <span class="autor">S&atilde;o 23:46h </span>! 
			E, claro, publicando tudo na Web pra ficar registrado (trof&eacute;u, j&aacute; que fiquei desde &agrave;s 18:30h com este problema) :-/ !
			<br /> <br />
			<a id="altabooks" href="http://www.altabooks.com.br/use-a-cabeca-javascript.html" >
			<img src="http://www.altabooks.com.br/images/thumbnails/15/185/9788576082132.gif" title="Javascript Head First" 
			alt="Capa do Livro de JavaScript" width="66" height="89"/></a>
			<span class="autor"> 10/07/2012: </span> e agora eu coloquei a nossa pedra de estima&ccedil;&atilde;o na p&aacute;gina... <br />
			Esta pedra &eacute; parte do exercicio de JavaScript da s&eacute;rie "Use a Cabe&ccedil;a" JavaScript, com poucas mudan&ccedil;as...<br />
			A &uacute;nica diferen&ccedil;a entre a pedra no alto da p&aacute;gina e a original &eacute; uma transpar&ecirc;ncia que eu fiz
			(usando Adobe Photoshop Elements) - assim a pedra n&atilde;o destoaria do fundo... Pura est&eacute;tica !  :-) <br />
			E n&atilde;o pense que estive parado este tempo todo, n&atilde;o ! Fiz uma &aacute;rvore geneal&oacute;gica da minha fam&iacute;lia e
			melhorei a "carinha" da p&aacute;gina do Andre Rieu...
			<br /> <br />
			<span class="autor">18/07/2012 (na verdade, foi dia 17, mas j&aacute; s&atilde;o 00:16h)</span><br/>
			E o estudo de JavaScript continua a todo vapor... J&aacute; fiz um fomrul&aacute;rio teste em <q>
			<a href="http://www.bolodamamae.com.br/pedidos.html">Bolo da Mam&atilde;e</a></q> e j&aacute; percebi que meu problema &eacute; 
			o Internet Explorer, onde nada fica bom... A prop&oacute;sito, já consigo saber este tipo de coisa... Cique no bot&atilde;o abaixo pra ver !
			<br />
			<input type="button" name="about" title="Sobre como voc&ecirc; est&aacute; na Internet" value="Sobre seu navegador..." onclick="qualBrowser()"/>
			<br /> <br />
			<span class="autor">20/07/2012 (01:06h)</span><br/>
			Eu estava indo dormir quando lembrei do modo de visualizacao do desenvolvedor, no Internet Explorer 9...<br />
			Bom, descobri o problema que fazia o script nao executar neste navegador: usei uma CONSTANTE para o preco do bolo, R$ 18,00. Estava tudo certo com
			os navegadores da concorr&ecirc;ncia, mas o erro no IE caiu bem na linha de declara&ccedil;&atilde;o da CONSTANTE. A&iacute; lembrei do que o livro 
			de JavaScript dizia, sobre nem todos os navegadores aceitarem este comando. 
			Teste rapido: troquei o comando <q>CONST</q> por <q>var</q> e <q>voi l&aacute;</q>, funcionou !!   ;-)
			<br /> <br />
			<span class="autor">27/07/2012 (08:19h)</span><br/>
			<a id="altabooks2" href="http://www.altabooks.com.br/use-a-cabeca-html-com-css-e-xhtml-2a-edicao.html" >
			<img src="http://www.altabooks.com.br/images/thumbnails/15/150/9788576082187.gif" title="HTML & CSS Head First" 
			alt="Capa do Livro de HTML" width="66" height="89"/></a>
			- Ah! Internet Explorer 9... Cada detalhe!<br />
			A p&aacute;gina n&atilde;o ficava boa nele porque o DTD estava com um coment&aacute;rio antes... Tirei o coment&aacute;rio e 
			tudo funcionou como deveria ser! Mas apenas no IE 9, pelo que li... desculpe se voc&ecirc; s&oacute; usa o IE e n&atilde;o tem esta vers&atilde;o. 
			Sinceramente, te aconselho a trocar de navegador. Use o Chrome, por exemplo (ou o Firefox, ou o Opera - s&oacute; preste aten&ccedil;&atilde;o
			se o seu banco est&aacute; funcionando direito nestes navegadores, pois este &eacute; o pior efeito colateral da troca... 
			Enfim, troque o navegador porque o problema &eacute; ele, n&atilde;o eu! (estou seguindo os padr&otilde;es da nova Web!!). 
			A prop&oacute;sito, marcas de links retiradas das imagens, coisa que s&oacute; o IE fazia...<br />
			
			- A pedra virtual est&aacute; bem melhor, mas algumas coisas simplesmente n&atilde;o v&atilde;o funcionar nem no IE9, s&oacute; no 10!<br />
			E mensagens de alerta em debugs nunca foram t&atilde;o imoprtantes... Outro problema do DTD: meu JavaScript ficou obsoleto, parou de
			redimensionar a pedra por causa do DTD correto! Mas que inferno, rsrsrs... (estou rindo porque ao menos descobri o problema).
			<br />
			<br />
			<span class="autor">29/07/2012 (23:38h)</span><br/>
			<a id="perldeitel" href="http://www.deitel.com/Books/InternetWebScripting/PerlHowtoProgram1e/tabid/1819/Default.aspx" >
			<img src="http://www.deitel.com/books/perlHTP1/images/perlHTP1_thumb.jpg" title="Perl, How to Program (BR)" 
			alt="Capa do Livro Perl, Como Programar (Deitel)" width="66" height="89"/></a>
			Um pequeno passo para uma p&aacute;gina Web, mas um grande passo para um analista de sistemas... (rsrsrsrsrsr)<br />
			Eu, orgulhosamente, consegui <q>dar vida</q> a uma p&aacute;gina web pseudo-din&acirc;mica, o que me fez dizer que isso &eacute; um pequeno passo... <br />
			Mas &eacute; um script feito em Perl e roda maravilhosamente como um CGI, no lado do servidor, mesmo s&oacute; servindo pra dar a data e hora atuais.
			Uma belezinha ! E o melhor &eacute; que eu consegui utilizar um livro que eu j&aacute; tinha faz uns 10 anos e  nunca havia conseguido dar utilidade, 
			por nem trabalhar com Web, nem ter um servidor dispon&iacute;vel para rodar estes scripts, o que eu tenho agora nesse site ! <br />
			Emo&ccedil;&atilde;o indescrit&iacute;vel pra mim ! <br /> Obrigado p&eacute; quebrado, isso nunca teria sido poss&iacute;vel sem voc&ecirc; !
			Clique <a href="../cgi-bin/marco.pl">aqui</a> e ver&acute;s uma p&aacute;gina Perl rodando, <q>mixuruca</q>, mas de verdade...
			<br />
			</p>
			
		</div>
		
		<div class="footer">
			<p id="rodapeh"><br />Esta p&aacute;gina foi validada pelo W3C e est&aacute; <em>seguindo</em> os rigorosos padr&otilde;es XHTML 1.0 !! (20/07/2012 01:14 h).
			Tudo isso ainda usando Flash na p&aacute;gina, o maior e mais inesperado desafio do dia 30/06/12... Mas est&aacute; feito...<br />
			Em 20/07/12 o desafio foi o bot&atilde;o inserido na p&aacute;gina, mas isto &eacute; <q>ficha</q> perto do Flash ! ;-) <br />
			E foi validada com CSS n&iacute;vel 3 ! (27/06/2012 19:08 h)<br />
			<a href="http://validator.w3.org/check?uri=http%3A%2F%2Fwww.faltadoquefazer.com.br%2F"><img
			src="http://www.w3.org/Icons/valid-xhtml10" alt="Valid XHTML 1.0 Strict" height="31" width="88" /></a>
			<a href="http://jigsaw.w3.org/css-validator/check/referer">
			<img style="border:0;width:88px;height:31px" src="http://jigsaw.w3.org/css-validator/images/vcss" alt="CSS válido!" />
			</a><br />
			O logotipo da <q>FaltaDoQueFazer</q> e o simp&aacute;tico insetinho chamado <q>Bug</q> s&atilde;o propriedade intelectual de Marco Filgueiras.<br />
			Bug: &copy; 2002 e FaltaDoQueFazer (logo): &copy; 2012.
			</p>
		</div>
	</body>
</html>
